Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказСвязи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаЗаказаПоставщику</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПлановуюСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПлановаяСебестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСебестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратнаяТара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Оценочная стоимость возвратной тары в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/SupplierOrderConfirm/Ext/Module.bsl
Функция OrderConfirm(order_num, order_date, order_status, supplier_order_num, supplier_order_date, order_uid, positions)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. OrderConfirm");
	
	ПараметрыСтруктура = ХранилищеJSONВСтруктуру(positions);
	ТЗНоменклатуры = ПараметрыСтруктура.positions;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status","");
	СтруктураДанных.Вставить("message","");
	
	ДокЗаказСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(order_uid));
	
	Если Не ЗначениеЗаполнено(ДокЗаказСсылка) Или Не ЗначениеЗаполнено(ДокЗаказСсылка.Номер) Тогда
		ДокЗаказСсылка = Документы.ЗаказПоставщику.НайтиПоНомеру(order_num, order_date);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЗаказСсылка) Тогда
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не найден заказ по order_uid = "+order_uid;		
		Результат = ДанныеВJSONХранилище(СтруктураДанных);		
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OrderConfirm " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));

		Возврат Результат;		
		
	КонецЕсли;	
	
	Если ДокЗаказСсылка.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден
	 Или ДокЗаказСсылка.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Закрыт Тогда
	 
	 	СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Заказ находится в статусе подтвержден/закрыт order_uid = "+order_uid;		
		Результат = ДанныеВJSONХранилище(СтруктураДанных);		
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OrderConfirm " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));

		Возврат Результат;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	ДокОбъект = ДокЗаказСсылка.ПолучитьОбъект();
		
	Если order_status = "Ошибка связи" Или order_status = "Нет доступа" Тогда 
		
		ДокОбъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.ОтказСвязи;
		
	Иначе		
		
		ДокОбъект.КодОтправкиАварда = СокрЛП(supplier_order_num);
		ДокОбъект.Комментарий = ?(СтрДлина(ДокОбъект.Комментарий) > 0, ДокОбъект.Комментарий + " ", "") + СокрЛП(supplier_order_num) + " от " + СокрЛП(supplier_order_date);  
		
		Для Каждого СтрНом ИЗ ТЗНоменклатуры Цикл
			
			КодСтроки = Число(СтрНом.pos_id);
			ПроизводительПоставщика = РаскодироватьСтроку(СокрЛП(СтрНом.brand), СпособКодированияСтроки.КодировкаURL);
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрНом.articul_mdm_id);
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				
				СтруктураДанных.status = "ERROR";
				СтруктураДанных.message = "Не найдена номенклатура по articul_mdm_id = " + СтрНом.articul_mdm_id;				
				Результат = ДанныеВJSONХранилище(СтруктураДанных);

				ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OrderConfirm " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
				Возврат Результат;
				
			КонецЕсли;		
			
			ПодтвКоличество = Число(СтрНом.confirmed_quantity);
			ПодтвЦена = Число(СтрНом.supplier_price);
			СтатусСтроки = СтрНом.pos_status;
			
			ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
			ПараметрыОтбора.Вставить("ПроизводительПоставщика", ПроизводительПоставщика);
			
			Если Не КодСтроки = 0 Тогда
				ПараметрыОтбора.Вставить("УИД", КодСтроки);
			КонецЕсли;
			
			НайденныеСтроки = ДокОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				СтруктураДанных.status = "ERROR";
				СтруктураДанных.message = "Не найдена строка по pos_id = " + СтрНом.pos_id + " и articul_mdm_id = " + СтрНом.articul_mdm_id + " и brand = " + ПроизводительПоставщика;
				Результат = ДанныеВJSONХранилище(СтруктураДанных);
				
				ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OrderConfirm " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
				Возврат Результат;
				
			КонецЕсли;		
			
			ПричинаОтказа = СтатусСтроки;
			КолвоОтмены = 0;
						
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				НайденнаяСтрока.Цена = ?(ПодтвЦена = 0, НайденнаяСтрока.Цена, ПодтвЦена);				
				
				Если НайденнаяСтрока.Количество > ПодтвКоличество Тогда					
					КолвоОтмены = НайденнаяСтрока.Количество - ПодтвКоличество;				
				Иначе				
					ПодтвКоличество = ПодтвКоличество - НайденнаяСтрока.Количество;					
				КонецЕсли;
				
				Если КолвоОтмены > 0 Тогда					
					
					Отказ = СоздатьКорректировкуЗаказаПоставщика(НайденнаяСтрока, КолвоОтмены, ДокОбъект.Ссылка, ПричинаОтказа, СтруктураДанных, СтрНом.pos_id);												
					
					Если Отказ Тогда
						
						ОтменитьТранзакцию();
						//Сообщение об ошибке уже сформировано в процедуре СоздатьКорректировкуЗаказаПоставщика
						Результат = ДанныеВJSONХранилище(СтруктураДанных);
						
						ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
						ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OrderConfirm " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
						Возврат Результат;
						
					КонецЕсли;					
				КонецЕсли;
				
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НайденнаяСтрока, ДокОбъект);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НайденнаяСтрока, ДокОбъект);
				
			КонецЦикла;
			
		КонецЦикла;
					
		ДокОбъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;
		
	КонецЕсли;
	
	Попытка
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураДанных.status = "OK";
		СтруктураДанных.message = "";
		ЗафиксироватьТранзакцию();		
		
	Исключение		
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не удалось провести заказ поставщику с order_uid = " + order_uid + " По причине: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		
	КонецПопытки;
	
	Результат = ДанныеВJSONХранилище(СтруктураДанных);
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис SupplierOrderConfirm", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OrderConfirm " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;	
	
КонецФункции

Процедура СоздатьКорректировкуЗаказаПокупателя(СтрокаТовары, ЗаказПокупателяСсылка, Проведение ) 
	
	НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
		
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.ЗаказПокупателя = ЗаказПокупателяСсылка;
	НовыйДок.Заполнить(ЗаказПокупателяСсылка);
	
	ТабЧастьТовары = НовыйДок.Товары;
	ТабЧастьТовары.Очистить();
	
	НоваяСтрока = ТабЧастьТовары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары); 
	
	// Получаем среднюю цену закупки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Цена) КАК СуммаПодсчит,
	|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	|	МАКСИМУМ(ЗаказПокупателяТовары.ТолькоРезерв) КАК ТолькоРезерв
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Ссылка
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателяСсылка);
	Запрос.УстановитьПараметр("Номенклатура", НоваяСтрока.Номенклатура);	
	                                            
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЦенаЗакупкиЗаЕдиницу = Окр(ВыборкаЗапроса.СуммаПодсчит / ВыборкаЗапроса.Количество, 2, 1); 
		НоваяСтрока.ТолькоРезерв = ВыборкаЗапроса.ТолькоРезерв; 
		
	КонецЦикла;
	
	НоваяСтрока.Цена = ЦенаЗакупкиЗаЕдиницу;
	
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, НовыйДок);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, НовыйДок);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДок);
	
	НоваяСтрока.ОтказПоставщика = Справочники.ПричиныЗакрытияЗаказов.ОтказПоставщика;
	НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;	

	НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СоздатьКорректировкуЗаказаПоставщика(ЗаказПоставщикаТоварыСтрока, КоличествоКорректировки, ЗаказПоставщика, ПричинаОтказа,  СтруктураДанных, pos_id)	
	
	КорректЗаказаПоставщику = Документы.КорректировкаЗаказаПоставщику.СоздатьДокумент();			
	КорректЗаказаПоставщику.Заполнить(ЗаказПоставщика);
	КорректЗаказаПоставщику.Дата = ТекущаяДата();
	КорректЗаказаПоставщику.Комментарий = "Документ создан автоматич. web-сервисом ""SupplierOrderConfirm"" ";
	
	ТабЧастьТовары = КорректЗаказаПоставщику.Товары;
	ТабЧастьТовары.Очистить();	
	
	НоваяСтрока = ТабЧастьТовары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗаказПоставщикаТоварыСтрока);	
	НоваяСтрока.Количество = -1 * КоличествоКорректировки;
	НоваяСтрока.Заказ = ЗаказПоставщикаТоварыСтрока.Заказ;
	НоваяСтрока.ПричинаОтказа = ПричинаОтказа; 
	
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);	
	
	Попытка
		
		КорректЗаказаПоставщику.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ЗначениеЗаполнено(ЗаказПоставщикаТоварыСтрока.Заказ) Тогда
			СоздатьКорректировкуЗаказаПокупателя(КорректЗаказаПоставщику.Товары[0], ЗаказПоставщикаТоварыСтрока.Заказ, Истина);			
		КонецЕсли;
		
		Возврат Ложь;
		
	Исключение
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не удалось провести корректировку заказа поставщику для строки pos_id = " + pos_id + Символы.ПС + ОписаниеОшибки();
		Возврат Истина;	
		
	КонецПопытки;
				
КонецФункции

Функция ХранилищеJSONВСтруктуру(Данные)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Данные);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции

Функция ДанныеВJSONХранилище(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	Возврат JsonСтрока;
	
КонецФункции
